[
  {
    "num": 0,
    "name": "OFI",
    "type": "Team Project",
    "date": "2023.08.26 ~ 2023.09.26",
    "shortExpl": "\"OutFitIn, Your Personal Coordinator\" You can personally choose the coordinator. Coordinators can create their own portfolios and even use it as a side job.",
    "expl": "\"OFI\" is an abbreviation for OutFitIn, which stands for 'Clothing Coordination Platform.' It offers two versions for coordinators and users, referring to coordinators as \"Outers\" and users who wish to receive coordination as \"Fitters\". \n Our service is inspired by platforms like 'AirBnb' and 'Carrot Market,' focusing on communication and transactions among 'ordinary individuals.' Those with a keen interest in clothing, such as fashion design students and enthusiasts, can create their portfolios as coordinators and even generate additional income. On the other hand, for those less knowledgeable about fashion, they can receive coordination based on their desired occasions and styles.",
    "stacks": "React, Styled-Components, S3, Axios, Rest API, Docker, Cloud type",
    "reviews": "We achieved an overwhelming first place in the final award results. We successfully implemented numerous features within a short period and exceeded our initial goals, delivering a high-quality project. Over the course of four weeks, we made approximately 200 commits, mastering the collaborative process through pull requests (PR).\n From a technical perspective, we delved into React's asynchronous execution process while working with various hooks, such as useEffect and useRef. We also focused on passing parameters during page transitions and managing events through parent-child component communication. Furthermore, we honed our skills in making appropriate method calls and considering the timing of requests using Rest APIs. We became adept at mapping URLs and understanding various backend communication methods.",
    "function": "Bottom sheet, modal, login, email verification, chat, search, payment",
    "Deploy": "https://web-frontend-iciy2almolkc88.sel5.cloudtype.app/",
    "velog": "https://velog.io/@asj1966/GDG-Campus-Korea-X-%EC%99%93%EC%97%90%EB%B2%84-Whatever-you-make-%ED%96%89%EC%82%AC-%EC%B0%B8%EA%B0%80%ED%9B%84%EA%B8%B0",
    "github": "https://github.com/orgs/OutFitIn/repositories",
    "figma": "https://www.figma.com/file/qStAdcM6dhGwdAS7O8uNFC/Whateverthon-design?node-id=179%3A548&mode=dev",
    "insta": "https://www.instagram.com/outfitin_official/?igshid=NzZhOTFlYzFmZQ%3D%3D",
    "notion": "https://www.notion.so/notionofso/GDG-2117ffdb202e49c3906190262e623803"
  },
  {
    "num": 1,
    "name": "Portfolio",
    "type": "Solo Project",
    "date": "2023.10.18 ~ 2023.10.25",
    "shortExpl": "A portfolio project for developer job applications. Developed an interactive web page using scroll and mouse events.",
    "expl": "This is a project for front-end job applications. Instead of just presenting it in documents, I developed a portfolio website to showcase my development skills as a front-end developer. I organized my development goals, introduction, my tech stack, and projects to be easily visible at a glance. To facilitate convenient and efficient information exploration, I incorporated scroll events to navigate to the respective sections.",
    "stacks": "React, Styled-Components, Responsive Design, S3",
    "reviews": "Through completing this project independently within a tight schedule, I gained experience in the importance of development strategy and design. Moreover, I was able to apply the knowledge I've learned from previous projects, reinforcing and filling gaps.",
    "function": "S3 bucket creation and image upload, scroll navigation, simple email functionality, 3D card",
    "velog": "https://velog.io/@asj1966/%ED%86%A0%EC%9D%B4-%ED%94%84%EB%A1%9C%EC%A0%9D%ED%8A%B8-%ED%8F%AC%ED%8A%B8%ED%8F%B4%EB%A6%AC%EC%98%A4-%EC%9B%B9-%EC%82%AC%EC%9D%B4%ED%8A%B8",
    "github": "https://github.com/An-jisu/Portfolio/tree/master"
  },
  {
    "num": 2,
    "name": "Yorijori",
    "type": "Team Project",
    "date": "2023.08 ~ Ongoing",
    "shortExpl": "It provides travel routes for Jeju Island travelers based on selected travel destinations. It allows travelers to enjoy a true 'journey'.",
    "expl": "As a graduation project, I implemented a service for planning travel routes. Planning can be exhausting even before starting a trip. To savor the true essence of 'travel,' we plan travel itineraries based on the user's selected travel destinations. We provide travel routes for each day based on the optimal routes, considering the appropriate duration for the journey. Additionally, users can input their departure location for the first day, enabling us to design travel routes that take their arrival time into account.",
    "stacks": "React, Styled-Components, Flask, Map API, Python Algorithm",
    "reviews": "I joined a newly formed team as a front-end developer and team leader. However, we lacked team members with strong backend skills, which posed a challenge. Therefore, I took on as much work as possible on the front-end. During this process, I learned to persevere and find solutions. \nFrom a technical perspective, I learned to implement a map API to display travel destinations and routes on the map, enhancing my skills in using MapMarker and Polyline. I used Flask as a server to run algorithms and communicate with Python algorithm code via Axios on the front-end.",
    "function": "Local storage, map location markers, travel route generation, recent travel route display, my travel list",
    "github": "https://github.com/An-jisu/yorijori/tree/master",
    "figma": "https://www.figma.com/file/ZR7EFFGoKKcBguPsPQSBPu/%EB%A9%94%EC%9D%B8?type=design&node-id=0%3A1&mode=design&t=AUwRSgj78ox6DVUP-1"
  },
  {
    "num": 3,
    "name": "ChemistrAI",
    "type": "Team Project",
    "date": "2023.07.17 ~ 2023.08.04",
    "shortExpl": "A service for analyzing cosmetics ingredients based on ingredient's label images. This project was carried out with a focus on the business aspects at the Silicon Valley.",
    "expl": "This project was conducted during the vacation period while participating in a program at San Jose University in Silicon Valley with mentoring from industry professionals. First, the user inputs their skin type. Then, we take ingredient labels from the user, recognize the ingredient part in the images, and finally analyze and provide information on suitable or unsuitable ingredients for the user. In the front-end, I used Tailwind CSS to simplify the code's complexity in this short-term project.",
    "stacks": "React, Tailwind CSS, Flask",
    "reviews": "I took on the role of a front-end developer and team leader. Due to the business-oriented nature of Silicon Valley, the project focused more on business aspects rather than technical aspects, which I found a bit disappointing. However, during this process, I realized the importance of focusing on the 'business feasibility' rather than just 'implementability' when coming up with project ideas. This perspective influenced the choice of future project topics and helped me design personas and clarify the project's target audience. From a technical perspective, I had the opportunity to use Tailwind CSS to reduce the complexity of class naming and found its advantages.",
    "function": "Image capture and upload, distinguishing good and bad ingredients, ingredient information modal",
    "velog": "https://velog.io/@asj1966/%EC%82%B0%ED%98%B8%EC%84%B8-%EC%8B%A4%EB%A6%AC%EC%BD%98%EB%B2%A8%EB%A6%AC-San-Jose-university-%ED%94%84%EB%A1%9C%EC%A0%9D%ED%8A%B8",
    "github": "https://github.com/An-jisu/ChemistrAI/tree/master",
    "figma": "https://www.figma.com/file/MlpBPjHjZkDI2GTpKLSGuA/ChemistrAI-V1?type=design&node-id=0-1&mode=design&t=hg2RA7ANJS5UystS-0",
    "notion": "https://www.notion.so/3d2522d7355e48bfab0b9b2f74855208"
  },
  {
    "num": 4,
    "name": "Syncthon",
    "type": "Team Project",
    "date": "2023.07.03 ~ 2023.07.04",
    "shortExpl": "A 'development environment setup assistance service' for developers in the early stages of projects. This project was developed using React, marking my first project using this technology.",
    "expl": "We conducted a 12-hour hackathon with the keywords 'freedom,' 'playground,' and 'trouble-shooting.' Our team developed a collaboration environment setup assistance service called 'Syncthon' for developers.\n\nFor this hackathon, we chose a topic reflecting the confusion we faced in deciding which collaboration tools to use and how to share them. To address the initial confusion in project setup, collaboration tools, data storage, and remote repositories, we developed an efficient collaboration assistance service.",
    "stacks": "React, Tailwind, Styled-components, Post-CSS, Node.js",
    "reviews": "This hackathon provided an opportunity to objectively assess my skills and gain an overall understanding of the project. Working with people I had never met before in a hackathon taught me how to collaborate, apply CSS using Post-CSS, and use the Tailwind library. I experienced the entire process of a project in React, learned JSX syntax, and understood how to apply CSS within React. \nOne challenge was that our team did not have a designer, so we had to handle design ourselves, which was a bit difficult.",
    "function": "Two versions: PM/participant, sharing links to frameworks, databases, etc. to simplify collaboration development",
    "velog": "https://velog.io/@asj1966/%ED%95%B4%EC%BB%A4%ED%86%A4",
    "github": "https://github.com/bishoe01/UMC_HACKATHON/tree/main"
  },
  {
    "num": 5,
    "name": "nwitter",
    "type": "Solo Project",
    "date": "2023.04.27 ~ 2023.05.10",
    "shortExpl": "A Twitter clone coding toy project. Implemented key features like login and tweeting using Firebase. It was my first time to get to know the flow of state variables.",
    "expl": "This was my first project as I started learning React. I implemented the login and tweeting features of Twitter using React and managed data with Firebase. I installed react-router-dom and defined which components to render through route settings. I also learned the roles and execution sequence of React's App.js, index.js, and index.html files.",
    "stacks": "React, tailwind, styled-components, post-css, Node.js",
    "reviews": "I gained an understanding of the overall workings of the React library. I learned how to manage state variables using useState and experienced the memory efficiency of single-page applications (SPAs). I learned the differences between asynchronous and synchronous methods and understood the importance of fast rendering for usability. \nSince it was my first time working with React and Firebase, I documented everything from project setup to debugging on my Velog. This has become a valuable resource for reference in future projects.",
    "function": "Firebase data management, tweeting feature, login feature, signup feature",
    "velog": "https://velog.io/@asj1966/%ED%81%B4%EB%A1%A0-%EC%BD%94%EB%94%A9-%ED%8A%B8%EC%9C%84%ED%84%B0",
    "github": "https://github.com/An-jisu/nwitter"
  },
  {
    "num": 6,
    "name": "Netflix Clone",
    "type": "Solo Project",
    "date": "2023.03.31 ~ 2023.04.04",
    "shortExpl": "A toy project that I cloned the main page and login page of Netflix. Focused on designing and developing the website layout using HTML/CSS.",
    "expl": "Before diving into React, I worked on this project to study the layouts of famous websites. I focused on efficient layout structuring for each section and regular element placement.",
    "stacks": "HTML, External Stylesheet",
    "reviews": "I learned how to efficiently structure layouts using div tags. I realized the importance of pre-designing the overall structure through comments. This toy project allowed me to become familiar with attribute values that can be applied to assets, such as the autoplay attribute for videos. As a result of this project, I developed a habit of designing the main structure of a page using div tags before starting development in future projects.",
    "function": "Main page, Login page, Linkage",
    "github": "https://github.com/An-jisu/Netflix_clone_coding"
  },
  {
    "num": 7,
    "name": "Humanity",
    "type": "Team Project",
    "date": "2021.07.23 ~ 2021.11.22",
    "shortExpl": "A departmental community project 'Humanity.' I was able to learn the process of collaboration through my first web development project experience.",
    "expl": "In 2021, I developed an interest in web development for the first time, and this was my first web project. I worked with friends from my department to create a community like 'Everytime' exclusively for 'Human Intelligence Engineering' students. We chose sky blue as the main color, and I was responsible for developing the main page and my page using HTML/CSS skills.",
    "stacks": "HTML, External CSS",
    "reviews": "I learned the meaning of 'development project' that was previously ambiguous. I took on the role of team leader and successfully led the project team. During this project, I fell in love with the immediate visual impact of front-end development. I was fascinated by how making even a small CSS change could significantly alter the overall web layout. \nThis project was somewhat inexperienced as it involved repetitive code for bulletin boards, and we didn't proceed with backend communication. However, it served as a stepping stone for future projects of increasing complexity.",
    "function": "Main page, Grid, Board List, Write New Post page",
    "github": "https://github.com/An-jisu/Humanity"
  }
]
