[
  {
    "num": 0,
    "name": "OFI",
    "type": "Team Project",
    "date": "2023.08.26 ~ 2023.09.26",
    "shortExpl": "\"OutFitIn, OFI 나만의 코디네이터\" \n자신이 코디받고 싶은 코디네이터를 직접 선정할 수 있습니다. 코디네이터는 포트폴리오를 만들고, 부업으로도 활용할 수 있습니다.",
    "expl": "\"OFI\"는 OutFitIn의 줄임말로 '옷 코디 플랫폼'입니다. 코디네이터와 유저 2가지 버전이 존재하고, 코디네이터를 \"아우터\"로, 코디를 받기를 원하는 사용자를 \"피터\"로 지칭하였습니다. \n'일반인'들 간의 소통과 거래를 중심으로 하는 서비스인 'AirBnb'와 '당근마켓'에 모티브를 두고 시작하였습니다. 옷에 관심이 많거나, 패션 디자인학과 학생들과 같은 사람들은 코디네이터로서 자신만의 포트폴리오를 만들고, 부업으로 돈을 벌 수 있는 수단을 마련할 수 있습니다. 반면에, 옷을 잘 모르는, 자신이 원하는 상황과 스타일에 따라 코디를 받아볼 수 있습니다.",
    "stacks": "React, Styled-Components, S3, Axios, Rest API, Docker, Cloud type",
    "reviews": "최종 시상 결과 압도적인 1위를 차지하였습니다. 단기간에 많은 기능을 구현해냈고, 처음 목표 그 이상의 것을 달성해내며 높은 완성도를 보인 프로젝트였습니다. 며칠 간 고민하던 CORS 오류를 포기하지 않고 해결하는 과정을 통해 희열감을 느꼈습니다. 4주 간 약 200번의 commit을 통해 PR을 통한 협업 과정을 체득하였습니다.  \n기술적으로는 useEffect나 useRef, 페이지 이동 시 params 전달과 같은 hook 사용과, 부모와 자식 컴포넌트 props 전달을 통한 이벤트 핸들링 과정을 코딩하며 리액트의 비동기 실행의 과정을 반복했습니다. Rest API를 이용하여 각 기능에 알맞는 메소드 호출 방식과 요청 시점에 대해 고민하고, url 매핑 과정을 반복하며 백엔드와 통신 방식을 익혔습니다.",
    "function": "Bottom sheet, modal, 로그인, 이메일 인증, 채팅, 검색, 결제",
    "deploy": "https://web-frontend-iciy2almolkc88.sel5.cloudtype.app/",
    "velog": "https://velog.io/@asj1966/GDG-Campus-Korea-X-%EC%99%93%EC%97%90%EB%B2%84-Whatever-you-make-%ED%96%89%EC%82%AC-%EC%B0%B8%EA%B0%80%ED%9B%84%EA%B8%B0",
    "github": "https://github.com/orgs/OutFitIn/repositories",
    "figma": "https://www.figma.com/file/qStAdcM6dhGwdAS7O8uNFC/Whateverthon-design?node-id=179%3A548&mode=dev"
  },
  {
    "num": 1,
    "name": "Portfolio",
    "type": "Solo Project",
    "date": "2023.10.18 ~ 2023.10.25",
    "shortExpl": "개발자 취업을 위한 포트폴리오 프로젝트입니다. 스크롤 이벤트, 마우스 이벤트를 사용하여 인터렉션 페이지를 개발하였습니다.",
    "expl": "프론트엔드 취업을 위한 프로젝트입니다. 단지 서류로 보여드리기보다 프론트엔드 개발자로서의 개발 역량을 보여드리고자 직접 포트폴리오 사이트를 개발하였습니다. \n저의 개발 목표와 소개, 나의 기술 스택과 정도, 프로젝트를 보기 쉽게 한 눈에 보여드리고자 정리하였습니다. 편리하고 효율적인 정보 탐색을 위해서 스크롤 이벤트로 해당 영역으로 이동시켜 주도록 하였습니다.",
    "stacks": "React, Styled-Components, 반응형, S3",
    "reviews": "타이트한 일정 내에서 혼자 완성해내는 과정을 통해 개발 전략과 설계의 중요성을 경험하게 되었습니다. 또한, 지금껏 프로젝트들에서 배웠던 지식들을 직접 적용해보며 복습하며 메꾸고 채우는 시간을 가질 수 있었습니다.",
    "function": "S3 버킷 생성과 이미지 업로드, 스크롤 이동, 간편 이메일, 3D card",
    "velog": "https://velog.io/@asj1966/%ED%86%A0%EC%9D%B4-%ED%94%84%EB%A1%9C%EC%A0%9D%ED%8A%B8-%ED%8F%AC%ED%8A%B8%ED%8F%B4%EB%A6%AC%EC%98%A4-%EC%9B%B9-%EC%82%AC%EC%9D%B4%ED%8A%B8",
    "github": "https://github.com/An-jisu/Portfolio/tree/master"
  },
  {
    "num": 2,
    "name": "Yorijori",
    "type": "Team Project",
    "date": "2023.08 ~ ing",
    "shortExpl": "제주도 여행자들을 대상으로 여행 루트를 짜주는 프로젝트입니다. 선택된 여행지를 기반으로 효율적인 여행 루트를 짜주어, 진정한 '여행'을 떠날 수 있습니다.",
    "expl": "졸업 프로젝트로 여행 루트 짜주는 서비스를 구현하였습니다. 여행을 시작하기도 전에 계획을 짜다가 지치기도 합니다. 진정한 '여행'의 묘미를 위해 사용자가 선택한 여행지들을 바탕으로 여행 계획을 짜줍니다. 며칠 간의 여행이 적당할 지, 가장 효율적인 동선으로 각 날짜 별 여행 루트를 제공합니다. 또한, 사용자에게 첫 날의 출발지도 직접 입력받을 수 있게 하였습니다. 첫 날은 사용자의 도착 시간을 고려하여 여행 루트를 제공할 수 있게끔 설계하였습니다.",
    "stacks": "React, Styled-Components, Flask, Map API, Python Algorithm",
    "reviews": "막바진 짜여진 팀에 들어가 프론트엔드 개발자와 팀장의 역할을 맡았습니다. 하지만, 백엔드를 제대로 다룰 줄 아는 팀원이 없어 막막했습니다. 따라서 최대한 많은 부분을 프론트에서 처리하고자 하였습니다. 그 과정에서, 알고리즘을 제외한 서비스 구현은 제가 다 맡아서 진행되었고, 그 과정에서 어떻게든 해내는 끈기를 배웠습니다. \n 기술적으로는, Map API를 가져와서 여행지와 여행 루트를 지도에 보여주는 과정을 구현하며 MapMarker, Polyline 활용 능력을 기를 수 있었습니다. Flask 서버로 알고리즘을 돌리고, Axios로 요청하고 응답을 가져오는 과정에서, 파이썬 알고리즘 코드와 프론트의 통신 과정도 익히게 되었습니다.",
    "function": "로컬 스토리지, 지도에 위치 찍어주기, 여행 루트 생성, 최근 여행 루트 보여주기, 나의 여행 리스트",
    "github": "https://github.com/An-jisu/yorijori/tree/master",
    "figma": "https://www.figma.com/file/ZR7EFFGoKKcBguPsPQSBPu/%EB%A9%94%EC%9D%B8?type=design&node-id=0%3A1&mode=design&t=AUwRSgj78ox6DVUP-1"
  },
  {
    "num": 3,
    "name": "ChemistrAI",
    "type": "Team Project",
    "date": "2023.07.17 ~ 2023.08.04",
    "shortExpl": "성분표 이미지 기반 화장품 성분 분석 서비스입니다. 실리콘벨리 특성 상, 비지니스 측면에 초점을 두고 진행된 프로젝트였고, 창업 아이템을 떠올리고 사업화하는 방법에 초점을 두었습니다.",
    "expl": "방학 기간 동안 미국 실리콘벨리 San Jose Univ의 프로그램에 참여하여 실리콘벨리 현업자 분들의 멘토링과 함께 진행한 프로젝트입니다. \n먼저 사용자에게 피부 타입을 입력 받습니다. 그 후 성분표를 입력받아, 성분표 이미지를 분석해서 '성분' 부분만 파싱 해줍니다. 최종적으로, 사용자에게 맞는/맞지 않는 성분을 분석해서 알려줍니다. 프론트에서는 Tailwind CSS를 사용하며, 단기간의 프로젝트인 만큼 코드의 복잡도를 줄이고자 하였습니다. ",
    "stacks": "React, Tailwind CSS, Flask",
    "reviews": "저는 프론트엔드 개발자와 팀장의 역할을 맡았습니다. 사업의 성지인 실리콘벨리 특성 상, 기술적인 측면보다 비즈니스적인 측면에 초점을 두고 프로젝트가 진행된 것이 조금 아쉬웠습니다. 하지만 그 과정에서 프로젝트 아이디어를 떠올릴 때,'구현 가능성'이 아닌 '사업가능성'에 초점을 두는 것이 중요함을 깨달았고, 이후의 프로젝트 주제 선정에도 영향을 미쳤습니다. 페르소나를 설계하며, 프로젝트의 타겟도 명확히 할 수 있었습니다. \n 기술적으로는, Synthon 개발 시, 어깨 넘어 보았던 Tailwind CSS 라이브러리를 직접 사용해보며, class 명을 짓는 번거로움을 줄이는 것의 장점을 느낄 수 있었습니다.",
    "function": "촬영과 업로드, 좋은 성분/좋지 않은 성분 구분, 성분 정보 모달",
    "velog": "https://velog.io/@asj1966/%EC%82%B0%ED%98%B8%EC%84%B8-%EC%8B%A4%EB%A6%AC%EC%BD%98%EB%B2%A8%EB%A6%AC-San-Jose-university-%ED%94%84%EB%A1%9C%EC%A0%9D%ED%8A%B8",
    "github": "https://github.com/An-jisu/ChemistrAI/tree/master",
    "figma": "https://www.figma.com/file/MlpBPjHjZkDI2GTpKLSGuA/ChemistrAI-V1?type=design&node-id=0-1&mode=design&t=hg2RA7ANJS5UystS-0"
  },
  {
    "num": 4,
    "name": "Syncthon",
    "type": "Team Project",
    "date": "2023.07.03 ~ 2023.07.04",
    "shortExpl": "개발자들의 프로젝트 초기 '개발 환경 세팅 헬핑 서비스'입니다. 혼자 공부했던 React를 처음으로 사용해 개발한 프로젝트입니다. 단 시간 내에 '완성'하는 것을 목표로 하였습니다.",
    "expl": "자유로움', '플레이그라운드', '트러블 슈팅'이라는 키워드로 12시간동안 해커톤을 진행하였습니다. 개발자들 협업 환경 세팅 헬핑 서비스 'Syncthon'을 만들었습니다.\n이번 해커톤에서 초반 프로젝트 시작 시, 협업 툴 공유나 데이터베이스, 원격 저장소 등을 정하는 데 겪었던 혼란의 경험을 반영하여, 효율적인 '협업 헬핑 서비스'를 개발하였습니다. ",
    "stacks": "React, Tailwind, Styled-components, Post-css, Node.js",
    "reviews": "이 해커톤을 통해 내 실력을 객관화하는 시간이 되었고, 프론트/백엔드/PM의 협업을 통해 프로젝트의 전반적인 과정을 익힐 수 있었습니다. 처음보는 사람들과의 해커톤 경험을 통해 협업하는 방법, CSS 적용하는 POST-CSS, tailwind 라이브러리에 대해 익히게 되었습니다. 리액트를 통한 프로젝트의 전반적인 과정을 경험하였습니다. 또한, JSX문법을 익혔고, 리액트 내에서 css 적용하는 방법을 익혔습니다. \n아쉬웠던 점은, 저희 팀에는 디자이너가 없어서 우리가 직접 디자인까지 맡아서 해야했다는 것과 아이디어를 생각해내는 것이 어려웠습니다.",
    "function": "PM/참여자 2가지 버전, 링크 한 번에 공유 (링크 공유 번잡스러움 해결), 협업 개발 방식 단순화 (프레임워크, 데이터베이스 etc 입력받기)",
    "velog": "https://velog.io/@asj1966/%ED%95%B4%EC%BB%A4%ED%86%A4",
    "github": "https://github.com/bishoe01/UMC_HACKATHON/tree/main"
  },
  {
    "num": 5,
    "name": "nwitter",
    "type": "Solo Project",
    "date": "2023.04.27 ~ 2023.05.10",
    "shortExpl": "트위터 클론 코딩 토이 프로젝트입니다. 파이어베이스를 이용하여 로그인, 트윗과 같은 주요 기능을 구현하였습니다. 리액트의 상태 관리 흐름 파악의 첫 걸음입니다.",
    "expl": "리액트를 처음 공부하며 접해본 프로젝트입니다. 리액트로 트위터의 로그인과 트윗 기능을 구현해보고, 데이터들을 Firebase를 통해 관리하였습니다. React-router-dom을 설치하고, 라우터 설정을 통해 어떤 컴포넌트를 렌더링할 지 정해주었습니다. 또한, 리액트의 App.js, index.js, index.html 파일의 각 역할과 실행 순서를 익힐 수 익혔습니다.",
    "stacks": "React, External Stylesheet",
    "reviews": "React 라이브러리의 전반적인 동작 과정을 익힐 수 있었습니다. useState를 통한 상태 변수 관리 방법을 익히며 SPA의 메모리 효율성에 대해 느끼게 되었습니다. 비동기와 동기 방식의 차이점을 이해하게 되었고, 컴포넌트의 렌더링 방식을 배우며, 사용성을 높인 빠른 렌더링을 중요성을 인지하게 되었습니다. \n처음 리액트, 파이어베이스를 접했기에 프로젝트 생성 방법부터, 오류 원인/해결 과정을 벨로그에 정리해두었고, 이는 추후 다른 프로젝트에서 참고할 수 있는 자산이 되었습니다.",
    "function": "파이어베이스 데이터 관리, 트윗 기능, 로그인 기능, 회원가입 기능",
    "velog": "https://velog.io/@asj1966/%ED%81%B4%EB%A1%A0-%EC%BD%94%EB%94%A9-%ED%8A%B8%EC%9C%84%ED%84%B0",
    "github": "https://github.com/An-jisu/nwitter"
  },
  {
    "num": 6,
    "name": "Netflix Clone",
    "type": "Solo Project",
    "date": "2023.03.31 ~ 2023.04.04",
    "shortExpl": "넷플릭스의 메인 페이지와 로그인 페이지를 클론 코딩해 본 토이 프로젝트입니다. HTML과 CSS를 이용하여, 웹 사이트의 레이아웃을 설계하고 개발하는데 집중하였습니다.",
    "expl": "React를 본격적으로 공부하기에 앞서, 유명 웹 사이트의 레이아웃을 공부하기 위해, 진행해본 프로젝트입니다. 각 섹션 별로, 효율적으로 레이아웃을 구성하는 방법과 요소들의 규치적인 배치에 집중하였습니다. ",
    "stacks": "HTML, External Stylesheet",
    "reviews": "div태그를 통한 효율적인 레이아웃 구성 방법을 익힐 수 있었습니다. 주석을 통해 전체적인 틀을 사전 설계하는 것의 중요성을 깨달았습니다. 또한, video의 autoplay 속성과 같이, assets에 적용할 수 있는 속성 값에 익숙해지는 토이 프로젝트 였습니다. 이 프로젝트 결과, 이후의 프로젝트에서는 개발에 들어가기에 앞서, div태그를 통해 페이지의 큰 틀을 설계하는 습관을 지니게 되었습니다.",
    "function": "Main page, Login page, Linkage",
    "github": "https://github.com/An-jisu/Netflix_clone_coding"
  },
  {
    "num": 7,
    "name": "Humanity",
    "type": "Team Project",
    "date": "2021.07.23 ~ 2021.11.22",
    "shortExpl": "학과 커뮤니티 'Humanity' 웹 서비스 프로젝트입니다. 처음으로 진행한 웹 개발 프로젝트로, 협업의 과정을 익힐 수 있었습니다.",
    "expl": "2021년 처음 웹 개발에 관심을 가지게 되었고, 이 후 수행해본 첫 웹 프로젝트입니다. 학과 친구들과 함께 '에브리타임'과 같은 '휴먼지능정보공학과'만의 커뮤니티 제작을 하였습니다. 메인컬러를 하늘색으로 정했고, 저는 메인 페이지와 마이페이지 제작을 맡아 HTML/CSS 기술을 활용하여 개발했습니다.",
    "stacks": "HTML, External CSS",
    "reviews": "모호했던'개발 프로젝트'의 의미를 알게되었고, 제가 팀장을 맡아, 프로젝트 팀을 원만하게 이끌어 나갔습니다. 이 프로젝트를 통해 즉각적으로 눈에 보여지는 프론트의 매력에 빠지게되었습니다. 사소한 CSS 변경 하나로, 전체적인 웹 구성이 달라지는 게 신기했습니다. \n아무래도 처음이었기에 반복되는 게시판 부분을 같은 코드를 반복하기도 하였고, 백엔드 통신까지는 이어지지 못한 미숙한 프로젝트였습니다. 하지만, 이후 조금씩 난이도 있는 프로젝트로 성장해나가는 발판이 되어주었습니다.",
    "function": "Main page, Grid, Board List, Write New Post page",
    "github": "https://github.com/An-jisu/Humanity"
  }
]
